#  Базовий образ контейнера
FROM python:3.10

# Встановимо змінну середовища
ENV APP_HOME /app

# Встановимо робочу директорію всередині контейнера
WORKDIR $APP_HOME

# Встановимо залежності всередині контейнера
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Скопіюємо інші файли в робочу директорію контейнера
COPY . .

# Позначимо порт, де працює застосунок всередині контейнера
EXPOSE 5000

# Запустимо застосунок всередині контейнера
ENTRYPOINT ["python", "main.py"]